app/controllers/api/companies_controller.rb

    def show
        @company = Company.find_by(id: params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]