app/controllers/api/transactions_controller.rb

    def create
        @transaction = Transaction.new(transaction_params)
        @transaction.user_id = current_user.id
        if @transaction.save
---
INSERT INTO "transactions" ("user_id", "company_id", "purchase_price", "purchase_shares", "average_price", "net_shares", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def index
        if current_user
            @recent_transactions = Transaction.find_by_sql ["
                SELECT *
                FROM (
                    SELECT *, ROW_NUMBER() OVER (PARTITION BY company_id ORDER BY created_at DESC) AS rn
                    FROM transactions
                    WHERE transactions.user_id = ? ) AS rn
                WHERE rn = 1;", current_user.id]
            # @transactions = Transaction.where("user_id = ?", current_user.id).order(id: :ASC)
            # @company_list = @transactions.pluck(:company_id).uniq
            @transactions = Transaction.where("user_id = ?", current_user.id)
---
SELECT "transactions".* FROM "transactions" WHERE (user_id = 1) ORDER BY "transactions"."id" ASC