app/controllers/api/users_controller.rb

UPDATE "users" SET "current_buying_power" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_buying_power", 496400], ["updated_at", "2019-06-06 13:39:30.231215"], ["id", 1]]
---
    def update
        @user = current_user
        if @user.update(user_params)