app/controllers/api/watchlists_controller.rb

    def create
        @watchlist = Watchlist.new(watchlist_params)
        @watchlist.user_id = current_user.id
        if @watchlist.save
---
INSERT INTO "watchlists" ("user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["company_id", 14], ["created_at", "2019-06-22 15:37:52.255996"], ["updated_at", "2019-06-22 15:37:52.255996"]]

    def index
        @watchlists = Watchlist.where("user_id = ?", current_user.id)
---
SELECT "watchlists".* FROM "watchlists" WHERE (user_id = 1)

    def show
        @watchlist = Watchlist.where("user_id = ? AND company_id = ?", current_user.id, params[:id].to_i).first
---
SELECT  "watchlists".* FROM "watchlists" WHERE (user_id = 1 AND company_id = 14) ORDER BY "watchlists"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def destroy
        watchlist = Watchlist.find_by(id: params[:id])
        watchlist.destroy
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 1]]